PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
/*
 * Slave (Implant) - Implantable Device Application
 *
 * Ultra-low power operation: kimagu 2023.10.13
 *   1. MCU in Stop 2 mode (~2 uA)
 *   2. CC2500 in WOR mode (periodic RX sniff at 2.4 GHz)
 *   3. CC2500 GDO0 -> EXTI wakes MCU on beacon detection
 *   4. CC1101 is powered down until communication session
 *
 * Communication flow (Slave never initiates):
 *   1. CC2500 WOR detects wake-up beacon -> GDO0 EXTI -> MCU wakes
 *   2. Parse beacon, remember SESS + assigned MICS CHANNEL (chosen by Master
 *      via LBT before the beacon was sent)
 *   3. CC2500 sends wake-up ACK echoing DEVICE_ID+SESS+CHANNEL
 *   4. CC1101 tunes directly to the assigned MICS channel (no scanning)
 *   5. CC1101 responds to Master commands filtered by SESS + DEVICE_ID
 *   6. CC1101 powers down, CC2500 re-enters WOR, MCU -> Stop 2
 *
 * MCU: STM32U575 Q-series
 * Radios: CC2500 (2.4 GHz WOR wake-up), CC1101 (400 MHz MICS data)
 */

#include "cc1101.h"
#include "cc2500.h"
#include "protocol.h"
#include "stm32u575_lowpower.h"
#include <string.h>

#define AUTH_NONCE_LEN 4U
#define AUTH_TAG_LEN   4U
#define AUTH_ARG_LEN   (AUTH_NONCE_LEN + AUTH_TAG_LEN)
#define STREAM_CFG_SUBCMD 0x01U
#define STREAM_LOGICAL_DATA_MAX 17U
#define STREAM_FEC_COPIES 5U

/* ---------- low-power tuning knobs ---------- */
#define SLAVE_RTC_WAKEUP_INTERVAL_S   300U  /* raise to reduce periodic wakeups */
#define SLAVE_MICS_RX_WINDOW_MS       50U   /* lower to reduce active RX duty */

/* ---------- ship mode (long-term storage / transport) ----------
 * In ship mode CC2500 WOR is disabled entirely; both radios enter SPWD.
 * MCU runs Stop 3 (~1 µA) and wakes only via RTC for hourly diagnostics.
 * Auto-exit fires after SLAVE_SHIP_MAX_CHECKS (30 days); a physical WKUP
 * event (service magnet, factory tester) can trigger immediate exit.      */
#define SLAVE_SHIP_RTC_INTERVAL_S     3600U  /* 1-hour periodic battery / health check */
#define SLAVE_SHIP_MAX_CHECKS         720U   /* 720 h = 30 days → auto-exit to NORMAL */

typedef enum {
    SLAVE_RUN_NORMAL = 0U,  /* beacon-wait: CC2500 WOR + Stop 2 (default) */
    SLAVE_RUN_SHIP   = 1U,  /* storage:     CC2500/CC1101 Sleep + Stop 3  */
} SlavePowerProfile;

/* ---------- power trace (debugger-readable) ---------- */
typedef struct {
    uint32_t stop2_entries;
    uint32_t wakeup_exti_count;
    uint32_t wakeup_rtc_count;
    uint32_t wakeup_ok_count;
    uint32_t wakeup_fail_count;
    uint32_t mics_session_count;
    uint32_t mics_timeout_count;
    uint32_t last_stop2_enter_ms;
    uint32_t last_stop2_exit_ms;
    uint32_t last_session_start_ms;
    uint32_t last_session_end_ms;
    /* ship mode counters */
    uint32_t ship_entries;       /* times ship mode was entered */
    uint32_t ship_check_count;   /* total hourly wake-ups inside ship mode */
} Slave_PowerTrace;

volatile Slave_PowerTrace g_slave_pwr_trace = {0};

/* ---------- hardware handles ---------- */
static CC1101_HandleTypeDef g_cc1101;
static CC2500_HandleTypeDef g_cc2500;
static LP_HandleTypeDef     g_lp;

/* These would be defined by CubeMX-generated code */
extern SPI_HandleTypeDef hspi1;
extern SPI_HandleTypeDef hspi2;
extern RTC_HandleTypeDef hrtc;

/* ---------- device identity ---------- */
static const uint8_t g_my_id[PROTO_DEVICE_ID_LEN] = {0x00, 0x00, 0x00, 0x01};

/* ---------- authorised Master identity (factory-paired) ----------
 * This Slave accepts wake-up / COMMAND frames ONLY if they carry this
 * MASTER_ID in the payload. Provisioned at the factory during pairing
 * with a specific Programmer. Rejecting frames from unauthorised
 * Masters mitigates the trivial spoof attack where an attacker who
 * learns the DEVICE_ID could otherwise wake the implant at will.
 *
 * NOTE: This is a pre-shared identifier, not a cryptographic key.
 * Strong authentication (HMAC / signatures / nonce-based freshness)
 * must be layered on top at the application level if the threat
 * model requires it. */
static const uint8_t g_authorized_master_id[PROTO_MASTER_ID_LEN] =
    {0xAA, 0xBB, 0xCC, 0xDD};

/* ---------- session state ---------- */
static volatile bool g_wakeup_flag       = false;
static volatile bool g_cc1101_gdo0_flag  = false; /* set in EXTI ISR when CC1101 GDO0 asserts */

/* ---------- ship mode runtime state ---------- */
static SlavePowerProfile g_power_profile  = SLAVE_RUN_NORMAL;
static uint32_t          g_ship_check_count = 0U; /* hourly wake-up counter inside ship mode */
static uint8_t g_seq = 0U;
static uint8_t g_session_id     = PROTO_SESS_UNASSIGNED; /* assigned by Master wake-up */
static uint8_t g_active_channel = PROTO_CHANNEL_UNASSIGNED; /* MICS channel carried in beacon */
static uint8_t g_last_rx_seq = 0U;
static bool    g_last_rx_seq_valid = false;
static uint8_t g_session_nonce[AUTH_NONCE_LEN] = {0};
static bool    g_stream_enabled = false;
static uint8_t g_stream_interval_ms = 20U;
static uint8_t g_stream_remaining_frames = 0U;
static uint8_t g_stream_seq = 0U;

static const uint8_t g_auth_key[16] = {
    0x3A, 0x5C, 0x19, 0xE7, 0xA2, 0x4D, 0x77, 0x10,
    0x91, 0x2B, 0xC4, 0x6E, 0x58, 0xFD, 0x03, 0xAB
};

/* ---------- simulated sensor data ---------- */
static uint8_t g_sensor_data[16] = {
    0x01, 0x02, 0x03, 0x04,  /* placeholder sensor values */
    0x05, 0x06, 0x07, 0x08,
    0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00
};

/* ---------- forward declarations ---------- */
static void Slave_InitHardware(void);
static void Slave_EnterShipSleep(void);
static void Slave_EnterDeepSleep(void);
static int  Slave_HandleWakeUp(void);
static int  Slave_HandleMICSSession(void);
static int  Slave_ProcessCommand(const Proto_Packet *req, Proto_Packet *resp);
static void Slave_SendResponse(const Proto_Packet *resp, uint8_t channel);
static uint32_t Slave_Mac32(const uint8_t *buf, uint8_t len);
static bool Slave_VerifyPollAuth(const Proto_Packet *req);
static uint8_t Slave_BuildPollDataBody(uint8_t *out, uint8_t out_size);
static bool Slave_VerifyCmdAuthAndStoreNonce(const Proto_Packet *req);
static uint8_t Slave_BuildStreamDataBody(uint8_t *out, uint8_t out_size);
static bool Slave_SendStreamFragments(uint8_t channel);

/* ========================================================================== */
/* EXTI callback - CC2500 GDO0 wake-up interrupt                              */
/* ========================================================================== */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == g_cc2500.gdo0_pin) {
        g_wakeup_flag = true;
    }
    if (GPIO_Pin == g_cc1101.gdo0_pin) {
        g_cc1101_gdo0_flag = true;
    }
}

/* ========================================================================== */
/* Hardware initialization                                                     */
/* ========================================================================== */

static void Slave_InitHardware(void)
{
    CC1101_DWT_DelayInit();

    /* CC1101 handle (400 MHz MICS) - initially not used */
    g_cc1101.hspi      = &hspi1;
    g_cc1101.cs_port   = GPIOA;
    g_cc1101.cs_pin    = GPIO_PIN_4;
    g_cc1101.miso_port = GPIOA;
    g_cc1101.miso_pin  = GPIO_PIN_6;
    g_cc1101.gdo0_port = GPIOB;
    g_cc1101.gdo0_pin  = GPIO_PIN_0;

    /* CC2500 handle (2.4 GHz wake-up) */
    g_cc2500.hspi      = &hspi2;
    g_cc2500.cs_port   = GPIOB;
    g_cc2500.cs_pin    = GPIO_PIN_12;
    g_cc2500.miso_port = GPIOB;
    g_cc2500.miso_pin  = GPIO_PIN_14;
    g_cc2500.gdo0_port = GPIOB;
    g_cc2500.gdo0_pin  = GPIO_PIN_1;

