PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
    /* Low-power handle */
    g_lp.hspi_cc1101 = &hspi1;
    g_lp.hspi_cc2500 = &hspi2;
    /* CC2500 GDO0 (PB1 / EXTI1): deep-sleep beacon wakeup */
    g_lp.gdo0_port   = g_cc2500.gdo0_port;
    g_lp.gdo0_pin    = g_cc2500.gdo0_pin;
    g_lp.gdo0_irqn   = EXTI1_IRQn;
    /* CC1101 GDO0 (PB0 / EXTI0): MICS session RX wakeup from Stop 2 */
    g_lp.cc1101_gdo0_port = g_cc1101.gdo0_port;
    g_lp.cc1101_gdo0_pin  = g_cc1101.gdo0_pin;
    g_lp.cc1101_gdo0_irqn = EXTI0_IRQn;
    g_lp.hrtc         = &hrtc;

    LP_Init(&g_lp);

    /* Use lowest voltage scaling for minimum power */
    LP_SetVoltageScaling_LowPower();

    /* Initialize CC2500 for WOR wake-up mode */
    CC2500_InitWakeUp26MHz(&g_cc2500);
}

static uint32_t Slave_Mac32(const uint8_t *buf, uint8_t len)
{
    uint32_t h = 2166136261UL;
    for (uint8_t i = 0U; i < sizeof(g_auth_key); i++) {
        h ^= g_auth_key[i];
        h *= 16777619UL;
    }
    for (uint8_t i = 0U; i < len; i++) {
        h ^= buf[i];
        h *= 16777619UL;
    }
    return h;
}

static bool Slave_VerifyCmdAuthAndStoreNonce(const Proto_Packet *req)
{
    if (req->payload_len < (uint8_t)(PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN)) {
        return false;
    }

    const uint8_t *nonce = &req->payload[PROTO_CMD_ARGS_OFFSET];
    const uint8_t *tag_b = &req->payload[PROTO_CMD_ARGS_OFFSET + AUTH_NONCE_LEN];

    uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
    mac_input[0] = g_session_id;
    memcpy(&mac_input[1], g_my_id, PROTO_DEVICE_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_authorized_master_id, PROTO_MASTER_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], nonce, AUTH_NONCE_LEN);

    uint32_t expect = Slave_Mac32(mac_input, sizeof(mac_input));
    uint32_t got = ((uint32_t)tag_b[0]) |
                   ((uint32_t)tag_b[1] << 8) |
                   ((uint32_t)tag_b[2] << 16) |
                   ((uint32_t)tag_b[3] << 24);
    if (expect != got) {
        return false;
    }

    memcpy(g_session_nonce, nonce, AUTH_NONCE_LEN);
    return true;
}

static uint8_t Slave_BuildPollDataBody(uint8_t *out, uint8_t out_size)
{
    uint8_t body_len = (uint8_t)sizeof(g_sensor_data);
    uint8_t total = (uint8_t)(AUTH_ARG_LEN + body_len);
    if ((out == NULL) || (out_size < total)) {
        return 0U;
    }

    memcpy(out, g_session_nonce, AUTH_NONCE_LEN);

    uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
    mac_input[0] = g_session_id;
    memcpy(&mac_input[1], g_my_id, PROTO_DEVICE_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_authorized_master_id, PROTO_MASTER_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], g_session_nonce, AUTH_NONCE_LEN);
    uint32_t tag = Slave_Mac32(mac_input, sizeof(mac_input));
    out[4] = (uint8_t)(tag & 0xFFU);
    out[5] = (uint8_t)((tag >> 8) & 0xFFU);
    out[6] = (uint8_t)((tag >> 16) & 0xFFU);
    out[7] = (uint8_t)((tag >> 24) & 0xFFU);

    memcpy(&out[AUTH_ARG_LEN], g_sensor_data, body_len);
    return total;
}

static uint8_t Slave_BuildStreamDataBody(uint8_t *out, uint8_t out_size)
{
    const uint8_t stream_meta_len = 1U; /* stream_seq */
    uint8_t body_len = (uint8_t)sizeof(g_sensor_data);
    uint8_t total = (uint8_t)(AUTH_ARG_LEN + stream_meta_len + body_len);
    if ((out == NULL) || (out_size < total)) {
        return 0U;
    }

    memcpy(out, g_session_nonce, AUTH_NONCE_LEN);

    uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
    mac_input[0] = g_session_id;
    memcpy(&mac_input[1], g_my_id, PROTO_DEVICE_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_authorized_master_id, PROTO_MASTER_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], g_session_nonce, AUTH_NONCE_LEN);
    uint32_t tag = Slave_Mac32(mac_input, sizeof(mac_input));
    out[4] = (uint8_t)(tag & 0xFFU);
    out[5] = (uint8_t)((tag >> 8) & 0xFFU);
    out[6] = (uint8_t)((tag >> 16) & 0xFFU);
    out[7] = (uint8_t)((tag >> 24) & 0xFFU);

    out[AUTH_ARG_LEN] = g_stream_seq++;
    memcpy(&out[AUTH_ARG_LEN + stream_meta_len], g_sensor_data, body_len);
    return total;
}

static bool Slave_SendStreamFragments(uint8_t channel)
{
    uint8_t logical[STREAM_LOGICAL_DATA_MAX];
    logical[0] = g_stream_seq++;
    logical[1] = PROTO_APP_TYPE_WAVEFORM;
    logical[2] = PROTO_WAVEFORM_ECG;
    logical[3] = (uint8_t)sizeof(g_sensor_data); /* raw sample block length */
    memcpy(&logical[4], g_sensor_data, sizeof(g_sensor_data));

    uint8_t logical_len = (uint8_t)(4U + sizeof(g_sensor_data));
    if (logical_len > STREAM_LOGICAL_DATA_MAX) {
        return false;
    }

    for (uint8_t copy_idx = 0U; copy_idx < STREAM_FEC_COPIES; copy_idx++) {
        uint8_t body[AUTH_ARG_LEN + 4U + STREAM_LOGICAL_DATA_MAX];
        memcpy(body, g_session_nonce, AUTH_NONCE_LEN);
        uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
        mac_input[0] = g_session_id;
        memcpy(&mac_input[1], g_my_id, PROTO_DEVICE_ID_LEN);
        memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_authorized_master_id, PROTO_MASTER_ID_LEN);
        memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], g_session_nonce, AUTH_NONCE_LEN);
        uint32_t tag = Slave_Mac32(mac_input, sizeof(mac_input));
        body[4] = (uint8_t)(tag & 0xFFU);
        body[5] = (uint8_t)((tag >> 8) & 0xFFU);
        body[6] = (uint8_t)((tag >> 16) & 0xFFU);
        body[7] = (uint8_t)((tag >> 24) & 0xFFU);
        body[AUTH_ARG_LEN] = logical[0]; /* stream_seq */
        body[AUTH_ARG_LEN + 1U] = copy_idx;
        body[AUTH_ARG_LEN + 2U] = STREAM_FEC_COPIES;
        body[AUTH_ARG_LEN + 3U] = logical_len;
        memcpy(&body[AUTH_ARG_LEN + 4U], logical, logical_len);

        Proto_Packet pkt;
        pkt.fcf = Proto_FCF_Make(MICS_FCF_TYPE_DATA, false, true);
        pkt.seq = g_seq++;
        pkt.sess = g_session_id;
        pkt.payload_len = Proto_BuildDataPayload(MICS_DTYPE_ECG_DELTA,
                                                 g_my_id,
                                                 g_authorized_master_id,
                                                 body,
                                                 (uint8_t)(AUTH_ARG_LEN + 4U + logical_len),
                                                 pkt.payload,
                                                 sizeof(pkt.payload));
        if (pkt.payload_len == 0U) {
            return false;
        }
        Slave_SendResponse(&pkt, channel);
    }

