PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
    return true;
}

/* ========================================================================== */
/* Ship mode sleep  (long-term storage / transport)                            */
/*                                                                             */
/* Differences from normal deep sleep:                                         */
/*   - CC2500 in Sleep (SPWD), NOT WOR → no 500 ms sniff current              */
/*   - MCU in Stop 3 (~1 µA) instead of Stop 2                                */
/*   - RTC interval = 1 hour (battery / health check only)                    */
/*   - Exit via: auto-counter (30 days) or physical WKUP event                */
/* ========================================================================== */

static void Slave_EnterShipSleep(void)
{
    g_slave_pwr_trace.ship_entries++;
    g_slave_pwr_trace.last_stop2_enter_ms = HAL_GetTick();

    /* Both radios into hard Sleep: WOR is intentionally disabled in ship mode.
     * CC2500 GDO0 EXTI is still wired but the radio will not assert it. */
    CC1101_EnterSleep(&g_cc1101);
    CC2500_EnterSleep(&g_cc2500);

    /* Hourly RTC wakeup for battery / diagnostics sampling */
    LP_ConfigureRTCWakeUp(&g_lp, SLAVE_SHIP_RTC_INTERVAL_S);

    /* Stop 3: ~1 µA — deeper than Stop 2, SRAM retained.
     * Allowed wake sources: RTC wakeup timer + WKUP pin (physical exit). */
    LP_WakeupSource src = LP_EnterStop3(&g_lp);

    g_slave_pwr_trace.last_stop2_exit_ms = HAL_GetTick();

    if (src & LP_WAKEUP_RTC_ALARM) {
        g_ship_check_count++;
        g_slave_pwr_trace.ship_check_count++;
        g_slave_pwr_trace.wakeup_rtc_count++;

        /* Periodic diagnostic: record timestamp / battery proxy */
        g_sensor_data[8] = (uint8_t)(g_ship_check_count & 0xFFU);

        /* Auto-exit after SLAVE_SHIP_MAX_CHECKS (720 h = 30 days).
         * On the next main-loop iteration the profile is NORMAL,
         * so Slave_EnterDeepSleep() will re-arm CC2500 WOR and Stop 2. */
        if (g_ship_check_count >= SLAVE_SHIP_MAX_CHECKS) {
            g_power_profile    = SLAVE_RUN_NORMAL;
            g_ship_check_count = 0U;
        }
    }

    if (src & LP_WAKEUP_WKUP_PIN) {
        /* Physical exit event: service magnet, factory-tester pin, etc.
         * Immediately reverts to NORMAL without waiting for auto-exit. */
        g_power_profile    = SLAVE_RUN_NORMAL;
        g_ship_check_count = 0U;
    }
}

/* ========================================================================== */
/* Deep sleep entry (main idle state)                                          */
/* ========================================================================== */

static void Slave_EnterDeepSleep(void)
{
    /* Dispatch to ship FSM when in storage/transport mode */
    if (g_power_profile == SLAVE_RUN_SHIP) {
        Slave_EnterShipSleep();
        return;
    }

    g_slave_pwr_trace.stop2_entries++;
    g_slave_pwr_trace.last_stop2_enter_ms = HAL_GetTick();

    /* Ensure CC1101 is in sleep mode */
    CC1101_EnterSleep(&g_cc1101);

    /* If CC2500 was put into SPWD during MICS session, wake it first
     * so WOR strobes/register accesses are valid. */
    (void)CC2500_WakeFromSleep(&g_cc2500);

    /* Put CC2500 into WOR mode for wake-up monitoring */
    CC2500_EnterWOR(&g_cc2500);

    /* Configure RTC for periodic self-check */
    LP_ConfigureRTCWakeUp(&g_lp, SLAVE_RTC_WAKEUP_INTERVAL_S);

    /* Enter Stop 2 - MCU draws ~2 uA
     * Wake-up sources:
     *   - CC2500 GDO0 EXTI (beacon received)
     *   - RTC wake-up timer (periodic self-check)
     */
    LP_WakeupSource src = LP_EnterStop2(&g_lp);

    /* --- MCU wakes up here --- */
    g_slave_pwr_trace.last_stop2_exit_ms = HAL_GetTick();

    if (src & LP_WAKEUP_EXTI_GDO0) {
        g_wakeup_flag = true;
        g_slave_pwr_trace.wakeup_exti_count++;
    }

    if (src & LP_WAKEUP_RTC_ALARM) {
        g_slave_pwr_trace.wakeup_rtc_count++;
        /* Periodic self-check: battery level, sensor status, etc.
         * If nothing to do, go back to sleep immediately */
        g_sensor_data[8] = (uint8_t)(HAL_GetTick() & 0xFFU);  /* timestamp */
    }
}

/* ========================================================================== */
/* Phase 1: Handle CC2500 wake-up beacon                                       */
/* ========================================================================== */

static int Slave_HandleWakeUp(void)
{
    uint8_t rx_buf[CC2500_PKT_MAX_LEN];
    uint8_t rx_len = 0U;

    /* 1) Read the received beacon packet from CC2500 */
    CC2500_Status st = CC2500_ReadPacket(&g_cc2500, rx_buf, &rx_len, sizeof(rx_buf));
    if (st != CC2500_OK) {
        return -1;
    }

    /* 2) Parse MAC PDU */
    Proto_Packet beacon;
    if (Proto_ParsePacket(rx_buf, rx_len, &beacon) < 0) {
        return -2;
    }

    /* 3) Validate FCF: must be COMMAND type, ACK_REQ set */
    if (Proto_FCF_Type(beacon.fcf) != MICS_FCF_TYPE_COMMAND) {
        return -3;
    }
    if (!Proto_FCF_IsAckReq(beacon.fcf)) {
        return -3;
    }

    /* 4) Validate payload layout (13 B):
     *    [0]     DTYPE_COMMAND  [1]      CMD_WAKEUP_REQ
     *    [2..5]  DEVICE_ID      [6..9]   MASTER_ID
     *    [10]    SESS           [11]     CHANNEL      [12] flags
     */
    if (beacon.payload_len < PROTO_BEACON_PAYLOAD_LEN) {
        return -4;
    }
    if (beacon.payload[PROTO_BEACON_DTYPE_OFFSET] != MICS_DTYPE_COMMAND) {
        return -5;
    }
    if (beacon.payload[PROTO_BEACON_CMD_OFFSET] != CMD_WAKEUP_REQ) {
        return -6;
    }

    /* 5) Verify this beacon is addressed to us (or broadcast) */
    const uint8_t *target_id = &beacon.payload[PROTO_BEACON_DEVID_OFFSET];
    if (!Proto_MatchDeviceID(target_id, g_my_id)) {
        return -7;
    }

    /* 6) Verify MASTER_ID - reject beacons from unauthorised Masters.
     *    Without this check, anyone learning the Slave's DEVICE_ID could
     *    wake the implant and hold a session. */
    if (!Proto_VerifyPayloadMasterID(&beacon,
                                     PROTO_BEACON_MASTERID_OFFSET,
                                     g_authorized_master_id)) {
        return -8;  /* silent drop - unknown Master */
    }

