PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
                if (CC1101_EnterRx(&g_cc1101, g_active_channel) != CC1101_OK) {
                    session_active = false;
                    break;
                }

                g_cc1101_gdo0_flag = false;
                (void)LP_EnterStop2(&g_lp);
                /* --- ISRs have fired; SPI restored --- */

                /* Advance software timeout counter by one stream period */
                stream_elapsed_ms += (uint32_t)g_stream_interval_ms;
                if (stream_elapsed_ms > PROTO_SESSION_TIMEOUT_MS) {
                    g_slave_pwr_trace.mics_timeout_count++;
                    session_active = false;
                    break;
                }

                if (!g_cc1101_gdo0_flag) {
                    /* Woke due to RTC: stream interval elapsed → transmit */
                    if (Slave_SendStreamFragments(g_active_channel)) {
                        if (g_stream_remaining_frames > 0U) {
                            g_stream_remaining_frames--;
                            if (g_stream_remaining_frames == 0U) {
                                g_stream_enabled = false;
                            }
                        }
                    }
                }

                if (g_cc1101_gdo0_flag) {
                    /* CC1101 received a command during stream */
                    g_cc1101_gdo0_flag = false;
                    if (CC1101_ReadPacket(&g_cc1101,
                                         rx_buf, &rx_len,
                                         sizeof(rx_buf)) == CC1101_OK) {
                        bool end = Slave_HandleRxPacket(rx_buf, rx_len);
                        if (end) {
                            session_active = false;
                        } else {
                            stream_elapsed_ms = 0U; /* valid traffic resets timeout */
                        }
                    }
                }
            }

        } else {
            /*
             * Idle command-wait mode: MCU enters Stop 2 with CC1101 in RX.
             * CC1101 GDO0 EXTI (asserts on CRC-OK packet) wakes the MCU to
             * read the FIFO — no busy-poll at 4 MHz between exchanges.
             * RTC alarm fires if no valid packet arrives within the session
             * timeout, replacing HAL_GetTick() which freezes in Stop 2.
             *
             * Architecture:
             *   1. Set RTC alarm = PROTO_SESSION_TIMEOUT_S
             *   2. CC1101_EnterRx → radio stays in RX while MCU sleeps
             *   3. LP_EnterStop2 → ~2 µA until GDO0 EXTI or RTC fires
             *   4a. CC1101 GDO0 (g_cc1101_gdo0_flag): read packet, process,
             *       reset RTC alarm for next timeout window
             *   4b. RTC alarm: session timed out, exit
             */
            LP_ConfigureRTCWakeUp(&g_lp, PROTO_SESSION_TIMEOUT_MS / 1000U);

            if (CC1101_EnterRx(&g_cc1101, g_active_channel) != CC1101_OK) {
                /* Radio failed to enter RX — abort session */
                break;
            }

            g_cc1101_gdo0_flag = false;
            (void)LP_EnterStop2(&g_lp);
            /* --- MCU wakes here (ISRs have already fired) --- */

            if (g_cc1101_gdo0_flag) {
                /* CC1101 received a packet: ISR callback set the flag. */
                g_cc1101_gdo0_flag = false;

                if (CC1101_ReadPacket(&g_cc1101,
                                     rx_buf, &rx_len,
                                     sizeof(rx_buf)) == CC1101_OK) {
                    bool end = Slave_HandleRxPacket(rx_buf, rx_len);
                    if (end) {
                        session_active = false;
                    }
                    /* On any valid traffic: RTC is reset at the top of the
                     * next iteration via LP_ConfigureRTCWakeUp. */
                }
            } else {
                /* No CC1101 packet flag set → woke due to RTC timeout
                 * (or a spurious wakeup from an unrelated source). */
                g_slave_pwr_trace.mics_timeout_count++;
                session_active = false;
            }
        }
    }

    LP_DisableRTCWakeUp(&g_lp);

    /* Invalidate session */
    g_session_id     = PROTO_SESS_UNASSIGNED;
    g_active_channel = PROTO_CHANNEL_UNASSIGNED;
    g_last_rx_seq_valid = false;
    memset(g_session_nonce, 0, sizeof(g_session_nonce));
    g_stream_enabled = false;
    g_stream_remaining_frames = 0U;
    g_slave_pwr_trace.last_session_end_ms = HAL_GetTick();
    return 0;
}

/* ========================================================================== */
/* main                                                                        */
/* ========================================================================== */

int main(void)
{
    HAL_Init();

    /* SystemClock_Config() - generated by CubeMX */
    /* MX_GPIO_Init(), MX_SPI1_Init(), MX_SPI2_Init(), MX_RTC_Init() */

    Slave_InitHardware();

    /* Put CC1101 to sleep at startup (not needed until communication) */
    CC1101_EnterSleep(&g_cc1101);

    while (1) {
        /* Enter deep sleep - this is the primary state
         * MCU + CC1101 in deep sleep
         * CC2500 in WOR mode, sniffing for wake-up beacons
         */
        Slave_EnterDeepSleep();

        /* Check if woken by CC2500 beacon */
        if (g_wakeup_flag) {
            g_wakeup_flag = false;

            /* Handle the wake-up beacon - parses and stores SESS */
            int rc = Slave_HandleWakeUp();

            if (rc == 0) {
                g_slave_pwr_trace.wakeup_ok_count++;
                /* Wake-up successful - enter MICS data session */
                Slave_HandleMICSSession();
            } else {
                g_slave_pwr_trace.wakeup_fail_count++;
            }

            /* Session done or wake-up failed - return to deep sleep */
            CC1101_EnterSleep(&g_cc1101);
        }

        /* If woken by RTC, the self-check was done in Slave_EnterDeepSleep.
         * Loop back to sleep. */
    }
}
